1: Пользователь с таким аккаунтом не зарегистрирован!
2: Некорректный аккаунт!
3: Пользователь с таким аккаунтом уже зарегистрирован в системе!
4: Пользователь с таким именем уже зарегистрирован в системе!
5: Некорректное имя (должно состоять из символов латинского алфавита или цифр)!
6: Некорректная длина имени (длина должна быть 4-20 символов)!
7: Вы ввели некорректный возраст!
8: Неверно указан пол!
9: Проверьте правильность android аккаунта!
10: Проверьте правильность ввода города!
11: Пользователя с таким user_id нет в системе!
20: Неверная широта!
21: Неверная долгота!
22: Вы не отправляли свои координаты более 20 мин
23: Некорректый радиус!