100: Произошла непредвиденная ошибка!
1: Пользователь с таким аккаунтом не зарегистрирован!
2: Некорректный аккаунт!
3: Пользователь с таким аккаунтом уже зарегистрирован в системе!
4: Пользователь с таким именем уже зарегистрирован в системе!
5: Некорректное имя (должно состоять из символов латинского алфавита или цифр)!
6: Некорректная длина имени (длина должна быть 4-20 символов)!
7: Вы ввели некорректный возраст!
8: Неверно указан пол!
9: Проверьте правильность android аккаунта!
10: Проверьте правильность ввода города!
11: Пользователя с таким user_id нет в системе!
12: Ошибка при обновлении фото: отсутствуют данные фото
20: Неверная широта!
21: Неверная долгота!
22: Вы не отправляли свои координаты более 20 мин
23: Некорректый радиус!
30: Пользователя user_from нет в системе!
31: Пользователя user_to нет в системе!
32: Запрос между этими пользователями уже отправлялся!
33: Они не отправляли друг другу запросы!
34: Пользователь не отправлял запрос на приглашение в друзья!
35: Они не являются друзьями
36: Пользователь не может отправить запрос себе самому
40: Тело сообщения должно быть заполнено!
41: Сообщения с таким id нет в системе
42: Пользователя user нет в системе!
43: Пользователя friend нет в системе!